Revit 2024 API
RevisionsOnSheetUIServiceData.GetParentHwnd Method
 return the parent handle
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public IntPtr GetParentHwnd()
Visual Basic
Public Function GetParentHwnd As IntPtr
Visual C++
public:
IntPtr GetParentHwnd()
See Also
RevisionsOnSheetUIServiceData Class
Autodesk.Revit.UI Namespace